namespace MiniSvCodec
{
#include "Common/DataConv.h"

	//*******************************************************************************
	//	上位制御入力データを2バイトのデータに変換する
	//
	//	引数：
	//		value - double型のデータ
	//
	//	Note:
	//		最大誤差は0.03125
	//*******************************************************************************
	inline _UWORD ConvHighLevelInputData(double value)
	{
		return (_UWORD)((value - 520.0) * 32.0);
	}

	//*******************************************************************************
	//	2バイトのデータから上位制御入力データを復元する
	//
	//	引数：
	//		data   - ConvHighLevelInputDataで変換した2バイトのデータ
	//*******************************************************************************
	inline double DecHighLevelInputData(_UWORD data)
	{
		return data / 32.0 + 520.0;
	}

	//*******************************************************************************
	//	飛行速度を1バイトのデータに変換する
	//
	//	引数：
	//		value - double型のデータ
	//
	//	Note:
	//		最大誤差は0.04
	//*******************************************************************************
	inline _UBYTE ConvAirSpeed(double value)
	{
		return (_UBYTE)(value * 25.0);
	}

	//*******************************************************************************
	//	1バイトのデータから飛行速度を復元する
	//
	//	引数：
	//		data   - ConvAirSpeedで変換した1バイトのデータ
	//*******************************************************************************
	inline double DecAirSpeed(_UBYTE data)
	{
		return data / 25.0;
	}
}